alessandrocapotondi/mobilenet_v1_stm32_cmsis_nn/Src/main.c
#include <assert.h>

#include "main.h"
#include "stm32h7xx_hal.h"
#include "arm_math.h"
#include "arm_nnfunctions.h"


#define CONF 18
#include "intq-mobilenet-v1-pc.h"

//Layer 1	Conv / s2
static const uint8_t conv1_wt[CONV1_KER_DIM * CONV1_KER_DIM * CONV1_IM_CH * CONV1_OUT_CH>>LAYER1_WT_SHIFT] = CONV1_WT;
static const int32_t conv1_bias[CONV1_OUT_CH] = CONV1_BIAS;


//Layer 2	Conv dw/ s1
static const uint8_t conv2_wt[CONV2_KER_DIM * CONV2_KER_DIM * 1 * CONV2_OUT_CH>>LAYER2_WT_SHIFT] = CONV2_WT;
static const int32_t conv2_bias[CONV2_OUT_CH] = CONV2_BIAS;

//Layer 3	Conv Point/ s1
static const uint8_t conv3_wt[CONV3_KER_DIM * CONV3_KER_DIM * CONV3_IM_CH * CONV3_OUT_CH>>LAYER3_WT_SHIFT] = CONV3_WT;
static const int32_t conv3_bias[CONV3_OUT_CH] = CONV3_BIAS;

//Layer 4	Conv dw/ s2
static const uint8_t conv4_wt[CONV4_KER_DIM * CONV4_KER_DIM * 1 * CONV4_OUT_CH>>LAYER4_WT_SHIFT] = CONV4_WT;
static const int32_t conv4_bias[ CONV4_OUT_CH] = CONV4_BIAS;

//Layer 5	Conv Point/ s1
static const uint8_t conv5_wt[CONV5_KER_DIM * CONV5_KER_DIM * CONV5_IM_CH * CONV5_OUT_CH>>LAYER5_WT_SHIFT] = CONV5_WT;
static const int32_t conv5_bias[CONV5_OUT_CH] = CONV5_BIAS;

//Layer 6	Conv dw/ s1
static const uint8_t conv6_wt[CONV6_KER_DIM * CONV6_KER_DIM * 1 * CONV6_OUT_CH>>LAYER6_WT_SHIFT] = CONV6_WT;
static const int32_t conv6_bias[CONV6_OUT_CH] = CONV6_BIAS;

//Layer 7	Conv Point/ s1
static const uint8_t conv7_wt[CONV7_KER_DIM * CONV7_KER_DIM * CONV7_IM_CH * CONV7_OUT_CH>>LAYER7_WT_SHIFT] = CONV7_WT;
static const int32_t conv7_bias[CONV7_OUT_CH] = CONV7_BIAS;

//Layer 8	Conv dw/ s2
static const uint8_t conv8_wt[CONV8_KER_DIM * CONV8_KER_DIM * 1 * CONV8_OUT_CH>>LAYER8_WT_SHIFT] = CONV8_WT;
static const int32_t conv8_bias[CONV8_OUT_CH] = CONV8_BIAS;

//Layer 9	Conv Point/ s1
static const uint8_t conv9_wt[CONV9_KER_DIM * CONV9_KER_DIM * CONV9_IM_CH * CONV9_OUT_CH>>LAYER9_WT_SHIFT] = CONV9_WT;
static const int32_t conv9_bias[CONV9_OUT_CH] = CONV9_BIAS;

//Layer 10	Conv dw/ s1
static const uint8_t conv10_wt[CONV10_KER_DIM * CONV10_KER_DIM * 1 * CONV10_OUT_CH>>LAYER10_WT_SHIFT] = CONV10_WT;
static const int32_t conv10_bias[CONV10_OUT_CH] = CONV10_BIAS;

//Layer 11	Conv Point/ s1
static const uint8_t conv11_wt[CONV11_KER_DIM * CONV11_KER_DIM * CONV11_IM_CH * CONV11_OUT_CH>>LAYER11_WT_SHIFT] = CONV11_WT;
static const int32_t conv11_bias[CONV11_OUT_CH] = CONV11_BIAS;

//Layer 12	Conv dw/ s2
static const uint8_t conv12_wt[CONV12_KER_DIM * CONV12_KER_DIM * 1 * CONV12_OUT_CH>>LAYER12_WT_SHIFT] = CONV12_WT;
static const int32_t conv12_bias[CONV12_OUT_CH] = CONV12_BIAS;

//Layer 13	Conv Point/ s1
static const uint8_t conv13_wt[CONV13_KER_DIM * CONV13_KER_DIM * CONV13_IM_CH * CONV13_OUT_CH>>LAYER13_WT_SHIFT] = CONV13_WT;
static const int32_t conv13_bias[CONV13_OUT_CH] = CONV13_BIAS;

//Layer 14	Conv dw/ s1
static const uint8_t conv14_wt[CONV14_KER_DIM * CONV14_KER_DIM * 1 * CONV14_OUT_CH>>LAYER14_WT_SHIFT] = CONV14_WT;
static const int32_t conv14_bias[CONV14_OUT_CH] = CONV14_BIAS;

//Layer 15	Conv Point/ s1
static const uint8_t conv15_wt[CONV15_KER_DIM * CONV15_KER_DIM * CONV15_IM_CH * CONV15_OUT_CH>>LAYER15_WT_SHIFT] = CONV15_WT;
static const int32_t conv15_bias[CONV15_OUT_CH] = CONV15_BIAS;

//Layer 16	Conv dw/ s1
static const uint8_t conv16_wt[CONV16_KER_DIM * CONV16_KER_DIM * 1 * CONV16_OUT_CH>>LAYER16_WT_SHIFT] = CONV16_WT;
static const int32_t conv16_bias[CONV16_OUT_CH] = CONV16_BIAS;

//Layer 17	Conv Point/ s1
static const uint8_t conv17_wt[CONV17_KER_DIM * CONV17_KER_DIM * CONV17_IM_CH * CONV17_OUT_CH>>LAYER17_WT_SHIFT] = CONV17_WT;
static const int32_t conv17_bias[CONV17_OUT_CH] = CONV17_BIAS;

//Layer 18	Conv dw/ s1
static const uint8_t conv18_wt[CONV18_KER_DIM * CONV18_KER_DIM * 1 * CONV18_OUT_CH>>LAYER18_WT_SHIFT] = CONV18_WT;
static const int32_t conv18_bias[CONV18_OUT_CH] = CONV18_BIAS;

//Layer 19	Conv Point/ s1
static const uint8_t conv19_wt[CONV19_KER_DIM * CONV19_KER_DIM * CONV19_IM_CH * CONV19_OUT_CH>>LAYER18_WT_SHIFT] = CONV19_WT;
static const int32_t conv19_bias[CONV19_OUT_CH] = CONV19_BIAS;

//Layer 20	Conv dw/ s1
static const uint8_t conv20_wt[CONV20_KER_DIM * CONV20_KER_DIM * 1 * CONV20_OUT_CH>>LAYER20_WT_SHIFT] = CONV20_WT;
static const int32_t conv20_bias[CONV20_OUT_CH] = CONV20_BIAS;

//Layer 21	Conv Point/ s1
static const uint8_t conv21_wt[CONV21_KER_DIM * CONV21_KER_DIM * CONV21_IM_CH * CONV21_OUT_CH>>LAYER21_WT_SHIFT] = CONV21_WT;
static const int32_t conv21_bias[CONV21_OUT_CH] = CONV21_BIAS;

//Layer 22	Conv dw/ s1
static const uint8_t conv22_wt[CONV22_KER_DIM * CONV22_KER_DIM * 1 * CONV22_OUT_CH>>LAYER22_WT_SHIFT] = CONV22_WT;
static const int32_t conv22_bias[CONV22_OUT_CH] = CONV22_BIAS;

//Layer 23	Conv Point/ s1
static const uint8_t conv23_wt[CONV23_KER_DIM * CONV23_KER_DIM * CONV23_IM_CH * CONV23_OUT_CH>>LAYER23_WT_SHIFT] = CONV23_WT;
static const int32_t conv23_bias[CONV23_OUT_CH] = CONV23_BIAS;

//Layer 24	Conv dw/ s2
static const uint8_t conv24_wt[CONV24_KER_DIM * CONV24_KER_DIM * 1 * CONV24_OUT_CH>>LAYER24_WT_SHIFT] = CONV24_WT;
static const int32_t conv24_bias[CONV24_OUT_CH] = CONV24_BIAS;

//Layer 25	Conv Point/ s1
static const uint8_t conv25_wt[CONV25_KER_DIM * CONV25_KER_DIM * CONV25_IM_CH * CONV25_OUT_CH>>LAYER25_WT_SHIFT] = CONV25_WT;
static const int32_t conv25_bias[CONV25_OUT_CH] = CONV25_BIAS;

//Layer 26	Conv dw/ s1
static const uint8_t conv26_wt[CONV26_KER_DIM * CONV26_KER_DIM * 1 * CONV26_OUT_CH>>LAYER26_WT_SHIFT] = CONV26_WT;
static const int32_t conv26_bias[CONV26_OUT_CH] = CONV26_BIAS;

//Layer 27	Conv Point/ s1
static const uint8_t conv27_wt[CONV27_KER_DIM * CONV27_KER_DIM * CONV27_IM_CH * CONV27_OUT_CH>>LAYER27_WT_SHIFT] = CONV27_WT;
static const int32_t conv27_bias[CONV27_OUT_CH] = CONV27_BIAS;
/*
//Layer 29 fully connected/ s1
static const uint8_t fc28_wt[FC28_IM_CH*FC28_OUT_CH>>LAYER28_WT_SHIFT] = FC28_WT;
static const int32_t fc28_bias[FC28_OUT_CH] = FC28_BIAS;
*/
// Input / Output
#include "224_test_input_image.h"
static const uint8_t image_data[CONV1_IM_CH * CONV1_IM_DIM * CONV1_IM_DIM] = INPUT_IMAGE;
//uint8_t output_data[IP1_OUT] = {0};

