alessandrocapotondi/mobilenet_v1_stm32_cmsis_nn/Src/main.c
// Tensors Scratch
#define L2_TENSOR_IO_SIZE   (512000) //524288	//512000

#define L1_TENSOR_SIZE      (60000) //65536
uint8_t __attribute__((section (".L2RAM"))) l2_tensor_scratch[L2_TENSOR_IO_SIZE];
int16_t                                     l1_tensor_scratch[L1_TENSOR_SIZE];

void SystemClock_Config(void);
static void MX_GPIO_Init(void);

/******** Cycle counter defines  **********/
#define MOBILENET_PROFILE 1
volatile unsigned int cpu_cycles[30];
volatile unsigned int *DWT_CYCCNT = (volatile unsigned int *)0xE0001004; 	// Cycle Counter Register
volatile unsigned int *DWT_CONTROL= (volatile unsigned int *)0xE0001000;	// Counter Control Register
volatile unsigned int *SCB_DEMCR  = (volatile unsigned int *)0xE000EDFC;

#if MOBILENET_PROFILE
#define USR_MEM_BARRIER() \
	do { \
		asm volatile("" ::: "memory");\
	} while (0)

#define USR_CC_ENABLE() \
  do { \
	asm volatile("" ::: "memory"); \
	*SCB_DEMCR = *SCB_DEMCR | 0x01000000;\
	*DWT_CYCCNT = 0; \
	*DWT_CONTROL = *DWT_CONTROL | 1; \
	asm volatile("" ::: "memory"); \
  } while (0)

#define USR_CC_RESET() \
  do { \
	asm volatile("" ::: "memory"); \
	*DWT_CYCCNT = 0; \
	asm volatile("" ::: "memory"); \
  } while (0)

#define USR_GET_CC_TIMESTAMP(x) \
  do { \
	asm volatile("" ::: "memory"); \
	x = (*(volatile unsigned int *) DWT_CYCCNT); \
	asm volatile("" ::: "memory"); \
  } while (0)
#else
#define USR_MEM_BARRIER()
#define USR_CC_ENABLE()
#define USR_CC_RESET()
#define USR_GET_CC_TIMESTAMP(x)
#endif

#define MOBILENET_CHECKSUM 1
#if MOBILENET_CHECKSUM
volatile unsigned int checksums[30];
#define USR_CHECKSUM(x, nb_elements, id, bits) \
  do { \
	asm volatile("" ::: "memory"); \
	checksums[id] = 0; \
	int idx, s; \
	for (int i=0; i< nb_elements;i++) { \
		if (bits == 8) \
			checksums[id]+=x[i]; \
	    else if (bits == 4) { \
			idx = i / 2; \
			s = i % 2; \
			if (s == 0) \
			{ \
				checksums[id]+=(x[idx] & 0xF); \
			} else \
			{\
				checksums[id]+=((x[idx] & 0xF0)>>4); \
			}\
		}  else if (bits == 2) \
		{ \
			idx = i/4; \
			s = i % 4; \
			if (s == 0) \
			{ \
				checksums[id]+=(x[idx] & 0x3); \
			} else if (s == 1) \
			{ \
				checksums[id]+=((x[idx] & 0xC)>>2); \
			} else if (s == 2) \
			{ \
				checksums[id]+=((x[idx] & 0x30)>>4); \
			} else if (s == 3) \
			{ \
				checksums[id]+=((x[idx] & 0xC0)>>6); \
			} \
		} \
	} \
	asm volatile("" ::: "memory"); \
  } while (0)
#else
#define USR_CHECKSUM(x,nb_elements,id, bits)
#endif

int main(void)
{
	SCB_EnableICache(); //Enable I-Cache
	SCB_EnableDCache(); //Enable D-Cache
	HAL_Init();
	SystemClock_Config();
	MX_GPIO_Init();

	while(1) {
		int 	layerId = 0;
		int 	tensorId = 0;
		uint8_t *tensorIn  = l2_tensor_scratch;
		uint8_t *tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV1_OUT_DIM*CONV1_OUT_DIM*CONV1_OUT_CH>>LAYER1_OUT_SHIFT);

		/*Layer 1	Conv / s2
		*Convolutional
		*Cycle =c
		*/
		USR_CC_ENABLE();
		USR_CC_RESET();
		LAYER1();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV1_OUT_DIM*CONV1_OUT_DIM*CONV1_OUT_CH,layerId, 8 >> LAYER1_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV2_OUT_DIM*CONV2_OUT_DIM*CONV2_OUT_CH>>LAYER2_OUT_SHIFT);
		tensorId = !tensorId;

/*
		Layer 2	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER2();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV2_OUT_DIM*CONV2_OUT_DIM*CONV2_OUT_CH,layerId, 8 >> LAYER2_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV3_OUT_DIM*CONV3_OUT_DIM*CONV3_OUT_CH>>LAYER3_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 3	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER3();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV3_OUT_DIM*CONV3_OUT_DIM*CONV3_OUT_CH,layerId,8 >> LAYER3_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV4_OUT_DIM*CONV4_OUT_DIM*CONV4_OUT_CH>>LAYER4_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 4	Conv dw/ s2
		*dephtwise
		*Cycle =
*/
		LAYER4();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV4_OUT_DIM*CONV4_OUT_DIM*CONV4_OUT_CH,layerId,8 >> LAYER4_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV5_OUT_DIM*CONV5_OUT_DIM*CONV5_OUT_CH>>LAYER5_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 5	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER5();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV5_OUT_DIM*CONV5_OUT_DIM*CONV5_OUT_CH,layerId,8 >> LAYER5_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV6_OUT_DIM*CONV6_OUT_DIM*CONV6_OUT_CH>>LAYER6_OUT_SHIFT);
		tensorId = !tensorId;

/*
		Layer 6	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER6();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV6_OUT_DIM*CONV6_OUT_DIM*CONV6_OUT_CH,layerId,8 >> LAYER6_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV7_OUT_DIM*CONV7_OUT_DIM*CONV7_OUT_CH>>LAYER7_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 7	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER7();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV7_OUT_DIM*CONV7_OUT_DIM*CONV7_OUT_CH,layerId,8 >> LAYER7_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV8_OUT_DIM*CONV8_OUT_DIM*CONV8_OUT_CH>>LAYER8_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 8	Conv dw/ s2
		*dephtwise
		*Cycle =
*/
		LAYER8();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV8_OUT_DIM*CONV8_OUT_DIM*CONV8_OUT_CH,layerId,8 >> LAYER8_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV9_OUT_DIM*CONV9_OUT_DIM*CONV9_OUT_CH>>LAYER9_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 9	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER9();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV9_OUT_DIM*CONV9_OUT_DIM*CONV9_OUT_CH,layerId, 8 >> LAYER9_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV10_OUT_DIM*CONV10_OUT_DIM*CONV10_OUT_CH>>LAYER10_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 10	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER10();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV10_OUT_DIM*CONV10_OUT_DIM*CONV10_OUT_CH,layerId, 8 >> LAYER10_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV11_OUT_DIM*CONV11_OUT_DIM*CONV11_OUT_CH>>LAYER11_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 11	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER11();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV11_OUT_DIM*CONV11_OUT_DIM*CONV11_OUT_CH,layerId, 8 >> LAYER11_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV12_OUT_DIM*CONV12_OUT_DIM*CONV12_OUT_CH>>LAYER12_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 12	Conv dw/ s2
		*dephtwise
		*Cycle =
*/
		LAYER12();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV12_OUT_DIM*CONV12_OUT_DIM*CONV12_OUT_CH,layerId, 8 >> LAYER12_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV13_OUT_DIM*CONV13_OUT_DIM*CONV13_OUT_CH>>LAYER13_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 13	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER13();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV13_OUT_DIM*CONV13_OUT_DIM*CONV13_OUT_CH,layerId, 8 >> LAYER13_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV14_OUT_DIM*CONV14_OUT_DIM*CONV14_OUT_CH>>LAYER14_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 14	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER14();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV14_OUT_DIM*CONV14_OUT_DIM*CONV14_OUT_CH,layerId, 8 >> LAYER14_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV15_OUT_DIM*CONV15_OUT_DIM*CONV15_OUT_CH>>LAYER15_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 15	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER15();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV15_OUT_DIM*CONV15_OUT_DIM*CONV15_OUT_CH,layerId, 8 >> LAYER15_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV16_OUT_DIM*CONV16_OUT_DIM*CONV16_OUT_CH>>LAYER16_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 16	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER16();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV16_OUT_DIM*CONV16_OUT_DIM*CONV16_OUT_CH,layerId, 8 >> LAYER16_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV17_OUT_DIM*CONV17_OUT_DIM*CONV17_OUT_CH>>LAYER17_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 17	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER17();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV17_OUT_DIM*CONV17_OUT_DIM*CONV17_OUT_CH,layerId, 8 >> LAYER17_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV18_OUT_DIM*CONV18_OUT_DIM*CONV18_OUT_CH>>LAYER18_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 18	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER18();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV18_OUT_DIM*CONV18_OUT_DIM*CONV18_OUT_CH,layerId, 8 >> LAYER18_OUT_SHIFT); layerId++;
		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV19_OUT_DIM*CONV19_OUT_DIM*CONV19_OUT_CH>>LAYER19_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 19	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER19();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV19_OUT_DIM*CONV19_OUT_DIM*CONV19_OUT_CH,layerId, 8 >> LAYER19_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV20_OUT_DIM*CONV20_OUT_DIM*CONV20_OUT_CH>>LAYER20_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 20	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER20();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV20_OUT_DIM*CONV20_OUT_DIM*CONV20_OUT_CH,layerId, 8 >> LAYER20_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV21_OUT_DIM*CONV21_OUT_DIM*CONV21_OUT_CH>>LAYER21_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 21	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER21();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV21_OUT_DIM*CONV21_OUT_DIM*CONV21_OUT_CH,layerId, 8 >> LAYER21_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV22_OUT_DIM*CONV22_OUT_DIM*CONV22_OUT_CH>>LAYER22_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 22	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER22();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV22_OUT_DIM*CONV22_OUT_DIM*CONV22_OUT_CH,layerId, 8 >> LAYER22_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV23_OUT_DIM*CONV23_OUT_DIM*CONV23_OUT_CH>>LAYER23_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 23	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER23();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV23_OUT_DIM*CONV23_OUT_DIM*CONV23_OUT_CH,layerId, 8 >> LAYER23_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV24_OUT_DIM*CONV24_OUT_DIM*CONV24_OUT_CH>>LAYER24_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 24	Conv dw/ s2
		*dephtwise
		*Cycle =
*/
		LAYER24();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV24_OUT_DIM*CONV24_OUT_DIM*CONV24_OUT_CH,layerId, 8 >> LAYER24_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV25_OUT_DIM*CONV25_OUT_DIM*CONV25_OUT_CH>>LAYER25_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 25	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER25();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV25_OUT_DIM*CONV25_OUT_DIM*CONV25_OUT_CH,layerId, 8 >> LAYER25_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV26_OUT_DIM*CONV26_OUT_DIM*CONV26_OUT_CH>>LAYER26_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 26	Conv dw/ s1
		*dephtwise
		*Cycle =
*/
		LAYER26();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV26_OUT_DIM*CONV26_OUT_DIM*CONV26_OUT_CH,layerId, 8 >> LAYER26_OUT_SHIFT); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV27_OUT_DIM*CONV27_OUT_DIM*CONV27_OUT_CH>>LAYER27_OUT_SHIFT);
		tensorId = !tensorId;
/*
		Layer 27	Conv Point/ s1
		*pointwise
		*Cycle =
*/
		LAYER27();
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV27_OUT_DIM*CONV27_OUT_DIM*CONV27_OUT_CH,layerId, 8 >> LAYER27_OUT_SHIFT); layerId++;


//		tensorIn  = tensorOut;
//		if (!tensorId)
//			tensorOut = l2_tensor_scratch;
//		else
//			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (FC28_IM_CH);
//		tensorId = !tensorId;

